"""
Модуль texts.py.
В модуле расположен текст для кнопок reply и inline клавиатур.
"""


start = '''Хотите быть участником танцевальной команды, испытывать адреналин от выхода на сцену, побеждать на танцевальных чемпионатах, совсем, как в известных голливудских фильмах?
А может быть Вы хотите развить индивидуальность и быть баттловым танцором?
Или вам важно изучить историю и культуру танцевальных стилей?
А может быть Вы просто хотите найти дело для души, которое смогло бы отвлечь Вас от трудовых будней и подарить новые эмоции и впечатления?
Тогда Вы точно обратились по адресу 🤝
Выбирайте интересующую Вас тему на клавиатуре, которая расположена ниже. 
Желаем приятного знакомства с нашей академией 💙'''


about_us = '''<b>Танцевальная академия King Step Syndicate</b>

<i>King Step Syndicate</i>  существует  с <u>2007 г.</u>
Изначально <i>King Step Syndicate</i> являлся танцевальным коллективом, который объездил множество международных и всероссийских чемпионатов, как по России, так и за ее пределами.
Коллектив развивался настолько стремительно, что позднее это переросло уже в большую <b>танцевальную академию</b> со штатом преподавателей и множеством танцевальных команд различного уровня и возрастов.
На данный момент, <b>Танцевальная академия King Step Syndicate</b> продолжает влюблять в танцы людей разных возрастов - от совсем маленьких малышей до самых взрослых. Ведь для танцев не существует возраста❣️😉
Помимо всего прочего, <b>King Step Syndicate</b> не только про танцы, но и про новых друзей.
Танцевальное комьюнити - это всегда люди, поддерживающие друг друга, люди, объединенные любовью к танцу❣️🫂
'''

teacher_Anastasia = '''🌟 <u>Руководитель</u> и преподаватель Танцевальной академии King Step Syndicate - <b>Шапошникова Анастасия Васильевна</b>. 
Занимается танцами с самого детства. Профессиональный педагог-хореограф. Опыт преподавания - 17 лет. 
Преподаватель танцевальных направлений: Hip-hop, Afro, Krump, High Heels
За плечами Анастасии Васильевны множество призовых мест в различных чемпионатах/баттлах, сотни учеников. 
Анастасия Васильевна является не только талантливым хореографом, но и действующим участником своих команд - King Step Syndicate, Afroactive crew. 
Кроме того, продолжает развивать свои танцевальные навыки, посещая фестивали, мастер-классы, онлайн-обучения. 
Также, стоит у истоков начала развития Афро и Крамп культуры в городе Петрозаводск и продолжает развивать эти культуры в нашем городе по сей день.
'''

teacher_Valentina = '''🌟 Преподаватель Танцевальной академии King Step Syndicate - <b>Карпова Валентина Алексеевна</b>.
Занимается танцами более 6 лет. Талантливый молодой хореограф. Опыт преподавания - 3 года.
Преподаватель танцевальных направлений: Hip-hop, K-pop, Jazz-Funk
Для своего молодого возраста, Валентина Алексеевна уже во всю собирает команды, ставит для них номера и возит команды на соревнования.
Продолжает развивать свои танцевальные навыки, являясь участником нескольких команд академии в различных танцевальных направлениях - 
King Step Syndicate (старший состав), Karelian Krump Diaspora, Afroactive crew. Участвует в чемпионатах, посещает мастер-классы.
 
'''
teacher_Aleksandra = '''🌟 Преподаватель Танцевальной академии King Step Syndicate - <b>Кялина Александра Семеновна</b>.
Занимается танцами более 10 лет. Перспективный молодой хореограф. Опыт преподавания - 4 года.
Преподаватель танцевальных направлений: Hip-hop, Waacking
Начинала путь в Академии с команды Sky2Fly, далее присоединилась к команде King Step Syndicate и Free Dance Motion. Посещала мастер-классы разных хореографов, 
развивающихся в разных стилях, в том числе и международные классы. За последний год давала уже 4 своих класса, три из которых – хореографии в разных стилях (girly hip-hop, hip-hop и vogue), 
а один – класс по импровизации. На данный моменнт является участником команды King Step Syndicate.
'''
teacher_Vaselina = '''🌟 Преподаватель Танцевальной академии King Step Syndicate - <b>Алексахина Васелина Игоревна</b>.
Занимается танцами с маленьких лет и на данный момент танцует уже 9 лет. Самый молодой преподаватель академии. Опыт преподавания - 2 года. 
Преподаватель танцевальных направлений: Hip-hop
Васелина с детства является учеником Анастасии Васильевны, была участником нескольких команд в академии - Sub zero hit, King Step Syndicate, Karelian Krump Diaspora, Afroactive crew. 
Талантливый, быстро развивающийся танцор, одна из немногих, кто достаточно быстро перешел из детской команды (Sub zero hit) в команду с уровнем "продвинутые" (King Step Syndicate).
И вот теперь, Васелина Игоревна учит танцевать Hip-hop самых маленьких учеников академии.
'''


hip_hop = '''🧢<b>Hip-hop</b> - это целая огромная культура, которая зародилась в 60-х годах в рйонах гетто Нью-Йорка, США. 
Благодаря ди-джею Африке Бамбааттее (Afrika Bambaataa) популярная культура получила наименование «Hip-Hop». 
Культура развивалась сразу в нескольких направлениях: реп, брейк-данс, уличный спорт и граффити. 
Хип-хоп — это не просто музыкальное и танцевальное направление, это стиль жизни, со своим танцем, одеждой и языком. 
Hip-Hop выступает в роли уникального и неповторимого направления в танцах, предполагающего свободу, а также открытое противопоставление себя целому свету. 
Именно по этой причине свободными для него считаются не только движения, но и одежда танцоров.
Само название «хип-хоп» переводится с английского языка как «подъем-скачок» (hip - подъем, hop - скачок). 
'''

krump = '''🔥<b>Krump</b> расшифровывается как Kingdom Radically Uplifted Mighty Praise (Королевство Абсолютной Силы Духовной Похвалы).
Все те, кто были основателями крампа — люди верующие. Krump зародился в южных кварталах Лос-Анджелеса в 2000-х годах, это уличный стиль танца, своеобразная альтернатива уличному насилию.
По духу этот танец энергичный и довольно резкий, агрессивный. Главное, чтобы Krump соответствовал характеру танцора и его мироощущению.
Уникальность крампа заключена в характере его движений — крампер танцует отрывисто, быстро двигается, часто прыгает, и вступает в физический контакт с партнерами в баттле
TIGHT EYEZ, один из создателей, говорил так: "Крамп пугающий, потому что он пришел из пугающего времени. Это просто был период жизни, в котором эмоции должны были найти выход.
Так и родился танец! Крамп - это эмоции, которые ты испытываешь сейчас и то, каким ты хочешь быть в будущем. Это все Krump!"

'''

afro = '''🌴<b>Afro</b> нельзя назвать отдельным стилем танца, скорее это обобщенное название для этих танцев. Танцы в Африке делятся на традиционные и современные уличные.
На территории континента Африка порядка 54 страны, в каждой стране есть свой стиль танца (а то и не один). 
Например, в Гане танцуют Azonto, в Нигерии Naija Fusion, в Анголе Afrohouse и т.д. Если в одной хореографии совмещать стили из разных стран, это называют Afro Fusion
В каждом стиле есть своя музыка, манера, подача, свои степы. Афро дарит очень позитивные летние эмоции, вероятно поэтому привлекает многих людей.
Рассказывать про афро можно много, но лучше всего прийти на занятие и почувствовать это.

'''

k_pop = '''🫰<b>K-pop</b> - это танцевальное направление, основанное на сценических хореографиях южнокорейских поп-звёзд (айдолов).
Стиль характеризуется энергичными движениями, выверенной хореографией и уникальным стилем исполнения. 
Главная особенность — точное исполнение танца из клипа или концертного выступления айдолов, воспроизведение хореографии должно максимально совпадать с оригиналом.
В танцы в стиле K-pop входят элементы разных направлений и разнообразные техники: что-то из хип-хопа, что-то, напоминающее джаз фанк, что-то — в стиле Vogue.

'''

high_heels = '''👠<b>High Heels</b> - это танец на высоких каблуках или шпильках, который зародился в Лос-Анджелесе благодаря хореографу Энди Джею (Andye J), станцевавшей на каблуках Hip-Hop. 
Далее инициативу поддержала ее коллега из Нью-Йорка - легендарная Шерил Мураками.
Будучи танцем совершенно новым, High Heels не имеет собственной танцевальной базы как таковой. Движения, пластика, манера и музыкальность были заимствованы для хореографии на каблуках из других направлений. 
Это дает практически полную свободу хореографам в их постановках. В этом стиле нет жестких рамок в движениях, но есть возрастное ограничение – 16 лет. 
Танцоры, выступающие в этом направлении, снимают с себя зажатость, учатся уверенности в своей красоте и восстановлению внутренней гармонии.
'''

waacking = '''🫦<b>Waacking</b> (от слова waack – размахивать руками) - танцевальное направление, зародившееся в 70-е годы 20-го века как часть клубной культуры США.
Отличительной особенностью этого стиля танца являются резкие, быстрые и четкие движения рук в сочетании с манерными позами и проходками в духе подиумных моделей. 
Движения танцоров мощные и амплитудные, а также очень чувственные.  Для того чтобы хорошо исполнять вакинг нужно не только уделять внимание технике танца, 
но и не забывать про артистичность, кокетство, умение подать себя ярко, ведь именно такой флирт со зрителем лежит в основе этого стиля.
'''



schedule = '''
Расписание занятий <b>танцевальной академии King Step Syndicate</b>📆
Если Вы начинающий танцор, то на любое занятие c уровнем "начинающие" можно записаться. 
Если Вы танцор с опытом и хотите попасть в определенную команду с уровнем "продолжающие", "продвинутые",  запись на занятие по
согласованию с преподавателем.
'''


cost = '''
Стоимость занятий <b>танцевальной академии King Step Syndicate</b>💵
*Разовое посещение без абонемента подойдет для тех, у кого нет возможности посещать все тренировки по расписанию
**Абонементы могут быть на 8 и 12 занятий, абонемент действует в рамках месяца и подойдет для тех, кто планирует регулярно посещать тренировки 
<b>Первое пробное занятие - бесплатно</b>
'''


from aiogram.utils.markdown import hlink

#создание ссылок на вк и телеграм
kss = hlink('Вконтакте', 'https://vk.com/kingstepsyndicate')

av1 = hlink('Телеграм', 'https://t.me/Anastasia_intense_miss_tchozn')
av2 = hlink('Вконтакте', 'https://vk.com/dancingking')

va1 = hlink('Телеграм', 'https://t.me/myahumster')
va2 = hlink('Вконтакте', 'https://vk.com/lentii')

a1 = hlink('Телеграм', 'https://t.me/htmnsss')
a2 = hlink('Вконтакте', 'https://vk.com/a_kyalina')

vi1 = hlink('Телеграм', 'https://t.me/vase_lin_a')
vi2 = hlink('Вконтакте', 'https://vk.com/id571775526')


contacts = f'''
Узнать больше про жизнь академии можно в нашем сообществе {kss}
Остались вопросы, тогда вот контакты преподавателей:
💫 Анастасия Васильевна Шапошникова: 
        {av1}
        {av2}
💫 Валентина Алексеевна Карпова:
        {va1}
        {va2}     
💫 Александра Семеновна Кялина:
        {a1}
        {a2}  
💫 Васелина Игоревна Алексахина:
        {vi1}
        {vi2}                 
'''
#создание ссылки на карту с отметкой местонахождения
adress = hlink('ул. Кирова 19', 'https://maps.app.goo.gl/7rRDJLDWqDLSJ6a38')

location = f'''<b>Танцевальная академия King Step Syndicate</b> располагается в самом сердце Петрозаводска.
📍Адрес: 
        {adress} 
ТЦ «Максим», цокольный этаж, лестница с улицы ведёт вниз. Стеклянная дверь напротив лестницы.
Как ориентир вывески : «Финская лавка», «Vietnam food», «Second hand"


Там Вас встретят 2 светлых просторных зала (см фото выше) 🤗
'''

trophies = '''У <b>танцевальной академии King Step Syndicate</b> огромный послужной список 🏆
Команды академии объездили сотни чемпионатов в разных городах и странах.
Небольшая вырезка из послужного списка:
*Финляндия(Турку)-Швеция(Стокгольм) "Скандинавская жемчужина" - дипломы и стеклянная статуэтка за 1 и 2 места.
*Франция (Париж) Paris,je re time!- два кубка и диплома за 2 место в номинации street show
*Болгария (Китен) "Салют талантов"-кубок и диплом за 1 место в hip-hop направлении
*Испания (Коста Брава) «Салют талантов»-кубок и диплом за 2 место,юниоры в hip-hop направлении
*URBAN ФЕСТИВАЛЬ "UNITED DANCE OPEN" 15,16,17,18,19(СПБ)
*HIP-HOP INTERNATIONAL 2014, 2015, 2016 (Москва)
'''
#функция для статистики - количество пользователей
def statistick(count):
    text = f'Количество пользователей бота: <pre>{count}</pre>'
    return text



